; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v8 - type_1 ?v5 - type_2)
 	      (pred_3 ?v2 - object ?v5 - type_2)
	      (pred_1 ?v8 - type_1 ?v4 - type_3)
	      (pred_4 ?v8 - type_1 ?v2 - object ?v4 - type_3))

   (:action op_1
       :parameters  (?v8 - type_1 ?v6 ?v3 - type_2)
       :precondition (and  (pred_2 ?v8 ?v6))
       :effect (and  (pred_2 ?v8 ?v3)
		     (not (pred_2 ?v8 ?v6))))

   (:action op_3
       :parameters (?v8 - type_1 ?v7 - object ?v1 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v1) (pred_2 ?v8 ?v1) (pred_1 ?v8 ?v4))
       :effect (and (pred_4 ?v8 ?v7 ?v4)
		    (not (pred_3 ?v7 ?v1)) 
		    (not (pred_1 ?v8 ?v4))))

   (:action op_2
       :parameters (?v8 - type_1 ?v7 - object ?v1 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v7 ?v4) (pred_2 ?v8 ?v1))
       :effect (and (pred_3 ?v7 ?v1)
		    (pred_1 ?v8 ?v4)
		    (not (pred_4 ?v8 ?v7 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_02 obj_01 - type_1
obj_10 obj_05 obj_06 obj_03 - type_3
obj_11 obj_08 obj_07 - type_2
obj_09 obj_12 obj_04 - object)
(:init
(pred_2 obj_02 obj_11)
(pred_1 obj_02 obj_10)
(pred_1 obj_02 obj_05)
(pred_2 obj_01 obj_07)
(pred_1 obj_01 obj_06)
(pred_1 obj_01 obj_03)
(pred_3 obj_09 obj_11)
(pred_3 obj_12 obj_07)
(pred_3 obj_04 obj_07)
)
(:goal
(and
(pred_3 obj_09 obj_07)
(pred_3 obj_12 obj_11)
(pred_3 obj_04 obj_07)
)
)

(:constraints
  (always (not (pred_2 obj_02 obj_07)))
)
)

; plan
1. (op_1 obj_02 obj_11 obj_08)
   deleted: (pred_2 obj_02 obj_11)
   added: (pred_2 obj_02 obj_08)
   goals met: 1 of 3
2. (op_3 obj_01 obj_12 obj_07 obj_03)
   deleted: (pred_3 obj_12 obj_07) (pred_1 obj_01 obj_03)
   added: (pred_4 obj_01 obj_12 obj_03)
   goals met: 1 of 3
3. (op_1 obj_01 obj_07 obj_11)
   deleted: (pred_2 obj_01 obj_07)
   added: (pred_2 obj_01 obj_11)
   goals met: 1 of 3
4. (op_2 obj_01 obj_12 obj_11 obj_03)
   deleted: (pred_4 obj_01 obj_12 obj_03)
   added: (pred_3 obj_12 obj_11) (pred_1 obj_01 obj_03)
   goals met: 2 of 3
5. (op_3 obj_01 obj_09 obj_11 obj_06)
   deleted: (pred_3 obj_09 obj_11) (pred_1 obj_01 obj_06)
   added: (pred_4 obj_01 obj_09 obj_06)
   goals met: 2 of 3
6. (op_1 obj_01 obj_11 obj_07)
   deleted: (pred_2 obj_01 obj_11)
   added: (pred_2 obj_01 obj_07)
   goals met: 2 of 3
7. (op_2 obj_01 obj_09 obj_07 obj_06)
   deleted: (pred_4 obj_01 obj_09 obj_06)
   added: (pred_3 obj_09 obj_07) (pred_1 obj_01 obj_06)
   goals met: 3 of 3
